In [71]:
import numpy as np
import pandas as pd
data = {
    "Name": ["Alice_kundu", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
  }
df = pd.DataFrame(data)
print(df)

          Name   Age Department   Salary
0  Alice_kundu  25.0         HR  50000.0
1          Bob  30.0         IT  60000.0
2      Charlie  35.0    Finance  70000.0
3        David   NaN         IT  62000.0
4          Eve  29.0         HR      NaN
5        Alice  25.0         HR  50000.0

1. First check how many null value in our dataset each column.

In [72]:
df.isnull().sum()

Name          0
Age           1
Department    0
Salary        1
dtype: int64

clear the null values

In [73]:
df.dropna()

          Name   Age Department   Salary
0  Alice_kundu  25.0         HR  50000.0
1          Bob  30.0         IT  60000.0
2      Charlie  35.0    Finance  70000.0
5        Alice  25.0         HR  50000.0

In [ ]:
df.dropna(how="any")

          Name   Age Department   Salary
0  Alice_kundu  25.0         HR  50000.0
1          Bob  30.0         IT  60000.0
2      Charlie  35.0    Finance  70000.0
5        Alice  25.0         HR  50000.0

In [75]:
df.dropna(how="all") # when full row contain null value

          Name   Age Department   Salary
0  Alice_kundu  25.0         HR  50000.0
1          Bob  30.0         IT  60000.0
2      Charlie  35.0    Finance  70000.0
3        David   NaN         IT  62000.0
4          Eve  29.0         HR      NaN
5        Alice  25.0         HR  50000.0

Fill na values

In [76]:
df.fillna(0) # not use wiedly

          Name   Age Department   Salary
0  Alice_kundu  25.0         HR  50000.0
1          Bob  30.0         IT  60000.0
2      Charlie  35.0    Finance  70000.0
3        David   0.0         IT  62000.0
4          Eve  29.0         HR      0.0
5        Alice  25.0         HR  50000.0

Fill use column mean or median

In [77]:
df["Age"].fillna(df["Age"].mean())
# df["Age"].fillna(df["Age"].mean(), inpase = True) # directly change the main data set

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

Forword or backward fill

In [78]:
df["Salary"].fillna(method = "ffill") 
# df["Salary"].fillna(method = "bfill")

C:\Users\user\AppData\Local\Temp\ipykernel_5844\2502741243.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Salary"].fillna(method = "ffill")

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    62000.0
5    50000.0
Name: Salary, dtype: float64

Replace a particular value radomly

In [79]:
df["Name"].replace("Alice", "Barun")
# df["Name"].replace("Alice", "Barun", inplace= True)

0    Alice_kundu
1            Bob
2        Charlie
3          David
4            Eve
5          Barun
Name: Name, dtype: object

handling duplicates

In [80]:
df_dup = df[df.duplicated(keep="first")] # or teke last value as primary
df_dup

Empty DataFrame
Columns: [Name, Age, Department, Salary]
Index: []

drop duplicates

In [81]:
df.drop_duplicates() # show changes but not change the data set
# df = df.drop_duplicates() # directly change the data set

          Name   Age Department   Salary
0  Alice_kundu  25.0         HR  50000.0
1          Bob  30.0         IT  60000.0
2      Charlie  35.0    Finance  70000.0
3        David   NaN         IT  62000.0
4          Eve  29.0         HR      NaN
5        Alice  25.0         HR  50000.0

In [82]:
df["present_Salary"] = df["Salary"] + 333
df

          Name   Age Department   Salary  present_Salary
0  Alice_kundu  25.0         HR  50000.0         50333.0
1          Bob  30.0         IT  60000.0         60333.0
2      Charlie  35.0    Finance  70000.0         70333.0
3        David   NaN         IT  62000.0         62333.0
4          Eve  29.0         HR      NaN             NaN
5        Alice  25.0         HR  50000.0         50333.0

using Lambda function

In [83]:
df["present_Salary"] = df["present_Salary"].apply(lambda x: x + 333 if x>50333 else x)
df

          Name   Age Department   Salary  present_Salary
0  Alice_kundu  25.0         HR  50000.0         50333.0
1          Bob  30.0         IT  60000.0         60666.0
2      Charlie  35.0    Finance  70000.0         70666.0
3        David   NaN         IT  62000.0         62666.0
4          Eve  29.0         HR      NaN             NaN
5        Alice  25.0         HR  50000.0         50333.0

split the name

In [86]:
df[['first', "last"]] = df["Name"].str.split("_", expand= True)
print(df)

          Name   Age Department   Salary  present_Salary    first   last
0  Alice_kundu  25.0         HR  50000.0         50333.0    Alice  kundu
1          Bob  30.0         IT  60000.0         60666.0      Bob   None
2      Charlie  35.0    Finance  70000.0         70666.0  Charlie   None
3        David   NaN         IT  62000.0         62666.0    David   None
4          Eve  29.0         HR      NaN             NaN      Eve   None
5        Alice  25.0         HR  50000.0         50333.0    Alice   None

multiply age by 2